Revit 2026 API

# RevisionsOnSheetUIServiceDataGetParentHwnd Method

---

return the parent handle

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IntPtr GetParentHwnd()
```
```vb
Public Function GetParentHwnd As IntPtr
```
```cpp
public:
IntPtr GetParentHwnd()
```
```fsharp
member GetParentHwnd : unit -> IntPtr
```

#### Return Value

IntPtr

#### Reference

RevisionsOnSheetUIServiceData Class

Autodesk.Revit.UI Namespace